test/request-response-samples/addList__xsi_type/request.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Header/><soap:Body><ns1:addList xmlns:ns1="urn:example"><ns1:record xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns2="urn:example" xsi:type="ns2:NameRecord"><ns1:id>1</ns1:id><ns1:name>John</ns1:name></ns1:record></ns1:addList></soap:Body></soap:Envelope>